{"module": "keras_core.src.models.sequential", "class_name": "Sequential", "config": {"name": "sequential", "trainable": true, "dtype": "float32", "layers": [{"module": "keras_core.src.layers.core.input_layer", "class_name": "InputLayer", "config": {"batch_shape": [null, 271], "dtype": "float32", "sparse": false, "name": "input_layer"}, "registered_name": "InputLayer"}, {"module": "keras_core.src.layers.core.dense", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 512, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras_core.src.initializers.random_initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": "GlorotUniform"}, "bias_initializer": {"module": "keras_core.src.initializers.constant_initializers", "class_name": "Zeros", "config": {}, "registered_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": "Dense", "build_config": {"input_shape": [null, 271]}}, {"module": "keras_core.src.layers.core.dense", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras_core.src.initializers.random_initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": "GlorotUniform"}, "bias_initializer": {"module": "keras_core.src.initializers.constant_initializers", "class_name": "Zeros", "config": {}, "registered_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": "Dense", "build_config": {"input_shape": [null, 512]}}, {"module": "keras_core.src.layers.core.dense", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras_core.src.initializers.random_initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": "GlorotUniform"}, "bias_initializer": {"module": "keras_core.src.initializers.constant_initializers", "class_name": "Zeros", "config": {}, "registered_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": "Dense", "build_config": {"input_shape": [null, 128]}}], "build_input_shape": [null, 271]}, "registered_name": "Sequential", "build_config": {"input_shape": [null, 271]}, "compile_config": {"loss": {"module": "keras_core.src.losses.losses", "class_name": "BinaryCrossentropy", "config": {"name": "binary_crossentropy", "reduction": "sum_over_batch_size", "from_logits": false, "label_smoothing": 0.0, "axis": -1}, "registered_name": "BinaryCrossentropy"}, "loss_weights": null, "metrics": ["accuracy"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": true}}